Tekla Open API Reference for Tekla Structures 2025
PluginBase.InputDefinition.GetInput Method
 Returns the input Tekla Structures gave to the plug-in. The input is either a point instance, an identifier instance, an array list of points or an array list of identifiers. This is based on the input format returned from the DefineInput() method.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object GetInput()
Public Function GetInput As Object
Return Value
Type: Object
The input to use in the Run() method.
See Also
Reference
PluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace